[{"id":6,"organizer":"stianst","location":{"id":7,"name":null,"imageId":null,"street":null,"streetNum":null,"city":"Newcastle","zip":null,"country":"UK","latitude":null,"longitude":null},"time":1364770800000,"attendance":[{"id":37,"user":"stianst@gmail.com","response":"WILL_ATTEND"}],"title":"Experience AngularJS","description":"<p>In this session we'll explain the benefits of AngularJS, and compare it to other JS frameworks.</p>\n\n<p>For those interested there will be a hands on session afterwards where you'll learn to build and test a basic application using AngularJS.</p>\n\n<h3>Why AngularJS?</h3>\n\n<p>HTML is great for declaring static documents, but it falters when we try to use it for declaring dynamic views in web-applications. AngularJS lets you extend HTML vocabulary for your application. The resulting environment is extraordinarily expressive, readable, and quick to develop.</p>\n\n<h3>Alternatives</h3>\n<p>Other frameworks deal with HTML’s shortcomings by either abstracting away HTML, CSS, and/or JavaScript or by providing an imperative way for manipulating the DOM. Neither of these address the root problem that HTML was not designed for dynamic views.</p>\n\n<h3>Extensibility</h3>\n<p>AngularJS is a toolset for building the framework most suited to your application development. It is fully extensible and works well with other libraries. Every feature can be modified or replaced to suit your unique development workflow and feature needs. Read on to find out how.</p>","imageId":"angularjs.png","tags":["javascript","angular","web"]},{"id":29,"organizer":"marko.strukelj@gmail.com","location":{"id":30,"name":null,"imageId":null,"street":null,"streetNum":null,"city":"Ljubljana","zip":null,"country":"Slovenia","latitude":null,"longitude":null},"time":1364511600000,"attendance":[{"id":31,"user":"marko.strukelj@gmail.com","response":"WILL_ATTEND"},{"id":36,"user":"stianst@gmail.com","response":"WILL_ATTEND"},{"id":46,"user":"theute@gmail.com","response":"WILL_ATTEND"},{"id":54,"user":"Stian","response":"WILL_ATTEND"}],"title":"CafeBabe: GWT - Developing Web and Mobile Apps in Java","description":"GWT (Google Web Toolkit) is a mature development framework for developing web and mobile apps using Java. It's aimed primarily at Java developers who want to create modern, and optimized web and mobile applications, and don't want to mess with JavaScript language, and the specifics of different web browsers.\n<p>\nSession will start with an overview of GWT, and instructions for getting started with it. We'll see where GWT is particularly strong, and how it compares with other web frameworks, especially the ones based on JavaScript i.e. jQuery. We'll review available widget toolkits, client-server connectivity, customization options, real-world use cases where GWT is used in production systems. We'll also look at project history, latest developments, and what we can expect for the future.\n<p>\nJoin us at Kiberpipa for another interesting CafeBabe evening. \nThere's beer afterwards ;)","imageId":"gwt-logo.png","tags":["cafebabe"]},{"id":51,"organizer":"gabrielc.cardoso@gmail.com","location":{"id":52,"name":null,"imageId":null,"street":null,"streetNum":null,"city":"Boston","zip":null,"country":"US","latitude":null,"longitude":null},"time":1369710000000,"attendance":[{"id":53,"user":"gabrielc.cardoso@gmail.com","response":"WILL_ATTEND"}],"title":"AnDevCon: The Android Developer Conference","description":"<p>Whether you're an enterprise developer, work for a commercial software company, or are driving your own start-up, if you are building Android apps, you need to attend AnDevCon, May 28-31, 2013 in Boston.</p>\n<p>At AnDevCon you?ll find you will find hundreds of experienced developers and engineers like you attending more than 75 classes 100% focused on Android development. Hang out and network with colleagues and our expert speakers at coffee breaks, lunches and our fabulous Attendee Reception. More than 45 companies will be exhibiting or sponsoring.</p>\n<p>AnDevCon Boston ? previous exhibitors include Google, Amazon, GroupOn, Sony, Adobe, Samsung, Qualcomm, TapJoy, RIM, AT&T, Barnes & Noble, HTC, Intel and dozens of others.</p>\n\n<h3>Sessions</h3>\n<ul>\n<li>Android OpenGL ES Essentials, Parts I and II</li>\n<li>Android Performance Tips</li>\n<li>Battle-Tested Patterns in Android Concurrency</li>\n<li>Building NFC-Enabled Android Applications</li>\n<li>Connecting the Dots: Bluetooth in Your Application</li>\n</ul>\n\n<h3>Speakers</h3>\n<ul>\n<li><strong>Moe Tanabian</strong>: Senior Mobile Technologist and Strategist</li>\n<li><strong>Mike Wolfson</strong>: Android Developer for Choice Hotels International</li>\n<li><strong>Karim Yaghmour</strong>: CEO of Opersys</li>\n</ul>","imageId":"715c019e-391a-9bf1-3295-85ea811fa986.jpg","tags":["Android","Mobile"]},{"id":55,"organizer":"theute@gmail.com","location":{"id":56,"name":null,"imageId":null,"street":null,"streetNum":null,"city":"Charmey","zip":null,"country":"Switzerland","latitude":null,"longitude":null},"time":1380319200000,"attendance":[{"id":57,"user":"theute@gmail.com","response":"WILL_ATTEND"}],"title":"La Désalpe de Charmey","description":"\"Désalpe\" is the best-known of all traditional mountain festivities. After more than four months of grazing in alpine pastures, cows make their way down to the plain.","imageId":"2ac2d8c5-dc08-ddf3-ddeb-d8f364805b74.jpg","tags":["desalpe","charmey","cow"]},{"id":58,"organizer":"theute@gmail.com","location":{"id":59,"name":null,"imageId":null,"street":null,"streetNum":null,"city":"Neuchâtel","zip":null,"country":"Switzerland","latitude":null,"longitude":null},"time":1380232800000,"attendance":[{"id":60,"user":"theute@gmail.com","response":"WILL_ATTEND"}],"title":"Neuchâtel's Grape Harvest Festival","description":"Each year, the start of the grape harvests in the Neuchâtel Country is celebrated on the last weekend in September. For three days, traffic is banished from the city centre so that revellers can make merry in the accustomed style amid an ambience of light, music and laughter. The grand night-time procession with \"Guggenmusik\" (or \"Happy Music\") takes place on the Friday night, but groups in costume are out and about all through the festival. The children's fancy-dress parade, a joyful and colourful event, is traditionally held on the Saturday afternoon. The Sunday afternoon floral procession also attracts a vast crown of onlookers. Punctuated by fanfares and peppered with humorous touches by some of the groups in costume, this parade carries on the tradition of the procession of the grape-harvest carts, decorated with flowers and loaded with the wine-growers' tools, which takes place at the end of the grape harvest.","imageId":"aefc06b3-ad2b-c4c7-30b3-0e7c0067cdea.jpg","tags":["wine","festival"]},{"id":61,"organizer":"Stian","location":{"id":62,"name":null,"imageId":null,"street":null,"streetNum":null,"city":"Bergen","zip":null,"country":"Norway","latitude":null,"longitude":null},"time":1368745200000,"attendance":[],"title":"17 Mai","description":"Come celebrate the Norwegian Constitution Day in Bergen. We'll have a parade, including comic troupes, various local organizations, a children's parade, and the unique buekorps.","imageId":"7add6814-a84d-9982-8df6-797db2fabcee.jpg","tags":["parade","celebration"]}]